# ZonePhase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZonePhase Property
ParameterTypeId Class See Also
---
"Phase"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZonePhase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZonePhase As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZonePhase {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace